#Іншими словами, pass можна використовувати для позначення місця в коді, 
# яке може бути заповнене пізніше.
# В нашому прикладі, pass використовується всередині циклу for. 
# Це означає, що на кожній ітерації циклу виконується pass, який не робить нічого.
# Цикл просто проходить мільйон ітерацій, не виконуючи жодної дії на кожній з них.


#Тут pass використовується у функції, яка поки що не має вмісту.
#Оператор pass є корисним для тимчасового "заповнення" місця в коді, 
# що дозволяє вашій програмі виконуватися, навіть коли певні частини ще не були реалізовані.
def my_function():
    pass