#Розпакування списку дозволяє присвоїти елементи списку окремим змінним.

my_list = [1, 2, 3]
a, b, c = my_list

#Якщо вам потрібно ігнорувати деякі з елементів списку під час розпакування, 
# можна використовувати _:
a, _, c = my_list

#Можна також розпакувати частину списку, використовуючи *:
a, *rest = my_list

#Розпакування словників працює трохи інакше і зазвичай 
# використовується під час передачі аргументів у функцію.

def greet(name, age):
    print(f"Hello {name}, you are {age} years old.")

person_info = {"name": "Alice", "age": 25}
greet(**person_info)

